doc/doc.org
#+HTML_HEAD: <style>body { max-width: 80ex; margin: auto; font: 1.15em sans-serif; }</style>
#+TITLE: Documentation
* Data types
TWD has seven types. The types are text, number, boolean, date, regular
expression, item and /t/ set for any type /t/.
** Text
The syntax for a text string is ={text body}=, where =text body= can be any
string of characters. Matching pairs of curly braces inside the text body are
automatically escaped. To escape an unmatched closing curly brace, use a double
curly brace =}}=.
*** Predicates
| Operation      | Parameter | Result | Example            | Meaning                                     |
|----------------+-----------+--------+--------------------+---------------------------------------------|
| =:= (is)       | /text/    | /bool/ | =prop:{value}=     | =prop= is exactly "=value="                 |
| =/= (contains) | /text/    | /bool/ | =prop/{substring}= | =prop= contains "=substring="               |
| =<= (prefix)   | /text/    | /bool/ | =prop<{prefix}=    | =prop= starts with "=prefix="               |
| =>= (suffix)   | /text/    | /bool/ | =prop>{suffix}=    | =prop= ends with "=suffix="                 |
| =~= (matches)  | /regex/   | /bool/ | =prop~{regex}=     | =prop= matches regular expression "=regex=" |
*** Properties
| Operation | Type  | Result                             |
|-----------+-------+------------------------------------|
| =.length= | /num/ | Number of characters in the string |
** Item
(Missing documentation)
** Number
(Missing documentation.)
** Boolean
(Missing documentation.)
** Date
(Missing documentation.)
** Set
(Missing documentation.)

For some operation =.op= and a set =set= of /t/, the meaning of =set.op= depends
on the type of /op/. If op has type /t/ \to /u set/, then =set.op= will return
the union of =x.op= for each =x= in =set=, while =set&.op= will return the
intersection. Otherwise, =set*.op= for some operator =*= of type /(u, u) \to u/
will return the result of mapping each element =x= to =x.op= and reducing by
=*=.

1. =set.op= (op on t)
2. =set..op= (op on set)
3. =set*arg= (op on set)
4. =set.*arg= (op on t)
* Selections and filters
Some subset of all the items in the database is called a *selection*. Selections
are usually constructed by using *filters*.

TWD commands always act on the current selection. A command in TWD takes the
form
#+BEGIN_EXAMPLE
> [filter] [command] [arguments]
#+END_EXAMPLE
where =[filter]= is a filter that changes the selection, =[command]= is the name
of a command that will act on that selection, and =[arguments]= may be a list of
arguments given to the command.

The command /list/ simply lists all of the items in the current selection; it
does not take arguments. If no command is specified, /list/ is the default. This
means that typing a filter on the command line will list all items in the
database matching that filter.
** List of filter properties
*** Global ID (=id=)
*Type:* text\\

The simplest possible filter simply specifies the global ID of a single task;
for example, the task with global ID /a4/ is written =id:{a4}=:
#+BEGIN_EXAMPLE
> id:a4
 # | ID | Desc
---+----+---------------
 1 | 4v | Do the dishes
#+END_EXAMPLE
*** Description (=description=)
*Type:* text\\

This is the default property; when no property is specified, /description/ is
assumed. For example, to list all items whose description contains "buy":
#+BEGIN_EXAMPLE
> /buy
  | Description
--+------------------
1 | Buy milk
2 | Buy chocolate
3 | Decide which car to buy
#+END_EXAMPLE
(This command is equivalent to =desc/{buy} list=.)
Note that simply typing =example= will not list all items whose description
exactly matches "example", because this could be confused with the name of a
command; instead, use either ={example}= or =:example= to abbreviate
=description:{example}=.
*** All tags (=tags=)
*Type:* set of text\\

(Missing documentation.)
*** Any tag (=tag=)
*Type:* text\\

(Missing documentation.)
*** Active (=active=)
*Type:* boolean\\

This property is on if the item is active (meaning it can be completed) and off
if it is inactive.
