doc/doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-28 Sun 22:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Documentation</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2674fb7">1. Data types</a>
<ul>
<li><a href="#org41e1436">1.1. Text</a>
<ul>
<li><a href="#orga55706e">1.1.1. Predicates</a></li>
<li><a href="#org55d1670">1.1.2. Properties</a></li>
</ul>
</li>
<li><a href="#org5dd1e1f">1.2. Item</a></li>
<li><a href="#orgf423567">1.3. Number</a></li>
<li><a href="#org1db427c">1.4. Boolean</a></li>
<li><a href="#org9f79b8b">1.5. Date</a></li>
<li><a href="#org5237418">1.6. Set</a></li>
</ul>
</li>
<li><a href="#org9d709bf">2. Selections and filters</a>
<ul>
<li><a href="#org1509695">2.1. List of filter properties</a>
<ul>
<li><a href="#orgeea9e90">2.1.1. Global ID (<code>id</code>)</a></li>
<li><a href="#org3bd1804">2.1.2. Description (<code>description</code>)</a></li>
<li><a href="#org6b942dd">2.1.3. All tags (<code>tags</code>)</a></li>
<li><a href="#org1fa1cd3">2.1.4. Any tag (<code>tag</code>)</a></li>
<li><a href="#org58e4600">2.1.5. Active (<code>active</code>)</a></li>
<li><a href="#org622ef31">2.1.6. Completed (<code>done</code>)</a></li>
<li><a href="#org7ecbae8">2.1.7. Base urgency (<code>baseurgency</code>)</a></li>
<li><a href="#org11c81b9">2.1.8. Urgency (<code>urgency</code>)</a></li>
</ul>
</li>
<li><a href="#orgf6e67d8">2.2. Filter property types</a>
<ul>
<li><a href="#org73e1235">2.2.1. Text</a></li>
<li><a href="#orgd7cfa7a">2.2.2. Boolean</a></li>
<li><a href="#orgcaf6e48">2.2.3. Date</a></li>
<li><a href="#orgf282b89">2.2.4. Number</a></li>
<li><a href="#org068b0a8">2.2.5. Item</a></li>
<li><a href="#orga414a27">2.2.6. Set</a></li>
</ul>
</li>
<li><a href="#org079087c">2.3. Filter operators</a>
<ul>
<li><a href="#orgaa2b5f4">2.3.1. Unary operators</a></li>
<li><a href="#org28c6b5e">2.3.2. Binary operators</a></li>
</ul>
</li>
<li><a href="#orgcc49855">2.4. Local ids and listing references</a></li>
</ul>
</li>
<li><a href="#orgea011e2">3. Contexts</a></li>
<li><a href="#org6eead94">4. Commands</a>
<ul>
<li><a href="#orgc75908d">4.1. List selection (<code>list</code>)</a></li>
<li><a href="#orgdcbfd54">4.2. Modify selection (<code>modify</code>)</a>
<ul>
<li><a href="#orgfd74ad1">4.2.1. Arguments</a></li>
</ul>
</li>
<li><a href="#org5a979c1">4.3. Add task (<code>add</code>)</a></li>
<li><a href="#orgdddc6f7">4.4. Evaluating expressions (<code>eval</code>)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2674fb7" class="outline-2">
<h2 id="org2674fb7"><span class="section-number-2">1</span> Data types</h2>
<div class="outline-text-2" id="text-1">
<p>
TWD has seven types. The types are text, number, boolean, date, regular
expression, item and <i>t</i> set for any type <i>t</i>.
</p>
</div>
<div id="outline-container-org41e1436" class="outline-3">
<h3 id="org41e1436"><span class="section-number-3">1.1</span> Text</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The syntax for a text string is <code>{text body}</code>, where <code>text body</code> can be any
string of characters. Matching pairs of curly braces inside the text body are
automatically escaped. To escape an unmatched closing curly brace, use a double
curly brace <code>}}</code>.
</p>
</div>
<div id="outline-container-orga55706e" class="outline-4">
<h4 id="orga55706e"><span class="section-number-4">1.1.1</span> Predicates</h4>
<div class="outline-text-4" id="text-1-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operation</th>
<th scope="col" class="org-left">Parameter</th>
<th scope="col" class="org-left">Result</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>:</code> (is)</td>
<td class="org-left"><i>text</i></td>
<td class="org-left"><i>bool</i></td>
<td class="org-left"><code>prop:{value}</code></td>
<td class="org-left"><code>prop</code> is exactly "<code>value</code>"</td>
</tr>

<tr>
<td class="org-left"><code>/</code> (contains)</td>
<td class="org-left"><i>text</i></td>
<td class="org-left"><i>bool</i></td>
<td class="org-left"><code>prop/{substring}</code></td>
<td class="org-left"><code>prop</code> contains "<code>substring</code>"</td>
</tr>

<tr>
<td class="org-left"><code>&lt;</code> (prefix)</td>
<td class="org-left"><i>text</i></td>
<td class="org-left"><i>bool</i></td>
<td class="org-left"><code>prop&lt;{prefix}</code></td>
<td class="org-left"><code>prop</code> starts with "<code>prefix</code>"</td>
</tr>

<tr>
<td class="org-left"><code>&gt;</code> (suffix)</td>
<td class="org-left"><i>text</i></td>
<td class="org-left"><i>bool</i></td>
<td class="org-left"><code>prop&gt;{suffix}</code></td>
<td class="org-left"><code>prop</code> ends with "<code>suffix</code>"</td>
</tr>

<tr>
<td class="org-left"><code>~</code> (matches)</td>
<td class="org-left"><i>regex</i></td>
<td class="org-left"><i>bool</i></td>
<td class="org-left"><code>prop~{regex}</code></td>
<td class="org-left"><code>prop</code> matches regular expression "<code>regex</code>"</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org55d1670" class="outline-4">
<h4 id="org55d1670"><span class="section-number-4">1.1.2</span> Properties</h4>
<div class="outline-text-4" id="text-1-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operation</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>.length</code></td>
<td class="org-left"><i>num</i></td>
<td class="org-left">Number of characters in the string</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org5dd1e1f" class="outline-3">
<h3 id="org5dd1e1f"><span class="section-number-3">1.2</span> Item</h3>
<div class="outline-text-3" id="text-1-2">
<p>
(Missing documentation)
</p>
</div>
</div>
<div id="outline-container-orgf423567" class="outline-3">
<h3 id="orgf423567"><span class="section-number-3">1.3</span> Number</h3>
<div class="outline-text-3" id="text-1-3">
<p>
(Missing documentation.)
</p>
</div>
</div>
<div id="outline-container-org1db427c" class="outline-3">
<h3 id="org1db427c"><span class="section-number-3">1.4</span> Boolean</h3>
<div class="outline-text-3" id="text-1-4">
<p>
(Missing documentation.)
</p>
</div>
</div>
<div id="outline-container-org9f79b8b" class="outline-3">
<h3 id="org9f79b8b"><span class="section-number-3">1.5</span> Date</h3>
<div class="outline-text-3" id="text-1-5">
<p>
(Missing documentation.)
</p>
</div>
</div>
<div id="outline-container-org5237418" class="outline-3">
<h3 id="org5237418"><span class="section-number-3">1.6</span> Set</h3>
<div class="outline-text-3" id="text-1-6">
<p>
(Missing documentation.)
</p>

<p>
For some operation <code>.op</code> and a set <code>set</code> of <i>t</i>, the meaning of <code>set.op</code> depends
on the type of <i>op</i>. If op has type <i>t</i> &rarr; <i>u set</i>, then <code>set.op</code> will return
the union of <code>x.op</code> for each <code>x</code> in <code>set</code>, while <code>set&amp;.op</code> will return the
intersection. Otherwise, <code>set*.op</code> for some operator <code>*</code> of type <i>(u, u) &rarr; u</i>
will return the result of mapping each element <code>x</code> to <code>x.op</code> and reducing by <code>*</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-org9d709bf" class="outline-2">
<h2 id="org9d709bf"><span class="section-number-2">2</span> Selections and filters</h2>
<div class="outline-text-2" id="text-2">
<p>
Some subset of all the items in the database is called a <b>selection</b>. Selections
are usually constructed by using <b>filters</b>.
</p>

<p>
TWD commands always act on the current selection. A command in TWD takes the
form
</p>
<pre class="example">
&gt; [filter] [command] [arguments]
</pre>
<p>
where <code>[filter]</code> is a filter that changes the selection, <code>[command]</code> is the name
of a command that will act on that selection, and <code>[arguments]</code> may be a list of
arguments given to the command.
</p>

<p>
The command <i>list</i> simply lists all of the items in the current selection; it
does not take arguments. If no command is specified, <i>list</i> is the default. This
means that typing a filter on the command line will list all items in the
database matching that filter.
</p>
</div>
<div id="outline-container-org1509695" class="outline-3">
<h3 id="org1509695"><span class="section-number-3">2.1</span> List of filter properties</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgeea9e90" class="outline-4">
<h4 id="orgeea9e90"><span class="section-number-4">2.1.1</span> Global ID (<code>id</code>)</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
<b>Type:</b> text<br />
</p>

<p>
The simplest possible filter simply specifies the global ID of a single task;
for example, the task with global ID <i>a4</i> is written <code>id:{a4}</code>:
</p>
<pre class="example">
&gt; id:a4
 # | ID | Desc
---+----+---------------
 1 | 4v | Do the dishes
</pre>
</div>
</div>
<div id="outline-container-org3bd1804" class="outline-4">
<h4 id="org3bd1804"><span class="section-number-4">2.1.2</span> Description (<code>description</code>)</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
<b>Type:</b> text<br />
</p>

<p>
This is the default property; when no property is specified, <i>description</i> is
assumed. For example, to list all items whose description contains "buy":
</p>
<pre class="example">
&gt; /buy
  | Description
--+------------------
1 | Buy milk
2 | Buy chocolate
3 | Decide which car to buy
</pre>
<p>
(This command is equivalent to <code>desc/{buy} list</code>.)
Note that simply typing <code>example</code> will not list all items whose description
exactly matches "example", because this could be confused with the name of a
command; instead, use either <code>{example}</code> or <code>:example</code> to abbreviate
<code>description:{example}</code>.
</p>
</div>
</div>
<div id="outline-container-org6b942dd" class="outline-4">
<h4 id="org6b942dd"><span class="section-number-4">2.1.3</span> All tags (<code>tags</code>)</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
<b>Type:</b> set of text<br />
</p>

<p>
(Missing documentation.)
</p>
</div>
</div>
<div id="outline-container-org1fa1cd3" class="outline-4">
<h4 id="org1fa1cd3"><span class="section-number-4">2.1.4</span> Any tag (<code>tag</code>)</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
<b>Type:</b> text<br />
</p>

<p>
(Missing documentation.)
</p>
</div>
</div>
<div id="outline-container-org58e4600" class="outline-4">
<h4 id="org58e4600"><span class="section-number-4">2.1.5</span> Active (<code>active</code>)</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
<b>Type:</b> boolean<br />
</p>

<p>
This property is on if the item is active (meaning it can be completed) and off
if it is inactive.
</p>
</div>
</div>
