doc/doc.org
*** Completed (=done=)
*Type:* boolean\\

This property is on if the item has been marked as completed and off otherwise.
*** Base urgency (=baseurgency=)
*Type:* number\\

The base urgency of an item is the urgency that has been manually assigned to
that item. The =urgency= property is a read-only property that is computed from
the base urgency after taking into account various other factors.
*** Urgency (=urgency=)
*Type:* number\\

(Missing documentation.)
** Filter property types
Each filter property has a type. The types are /text/, /date/, /number/, /item/
and /set/. Each type supports various prediates.
*** Text
Note that all of the text predicates are case insensitive by default.

*Supported prediates:*
| Operation         | Example            | Meaning                                     |
|-------------------+--------------------+---------------------------------------------|
| =:= (is)          | =prop:{value}=     | =prop= is exactly "=value="                 |
| =/= (contains)    | =prop/{substring}= | =prop= contains "=substring="               |
| =<= (starts with) | =prop<{prefix}=    | =prop= starts with "=prefix="               |
| =>= (ends with)   | =prop>{suffix}=    | =prop= ends with "=suffix="                 |
| =~= (matches)     | =prop~{regex}=     | =prop= matches regular expression "=regex=" |
*** Boolean
*Supported prediates:*
| Operation    | Example | Meaning       |
|--------------+---------+---------------|
| =+= (has)    | =+prop= | =prop= is on  |
| =-= (hasn't) | =-prop= | =prop= is off |
*** Date
(Missing documentation.)
*** Number
(Missing documentation.)
*** Item
(Missing documentation.)
*** Set
(Missing documentation.)
** Filter operators
Filter operators can be used to modify and compose filters. Operators can be
unary or binary.
*** Unary operators
Most unary operators are written as =filter .operator=. Note
that parentheses can be used to specify how the operator binds to its argument,
and that spacing influences this as well. For example, the following commands
are equivalent:
#+BEGIN_EXAMPLE
> ((!#a, !#b).dep).not, #c
> !#a, !#b .dep.not, #c
#+END_EXAMPLE
Some unary operators can be written using prefix syntax. For example, =A.not=
can also be written =!A=.
**** Invert (=not=)
*Arity:* unary\\
*Alias:* =!= (prefix)\\

This operator inverts the filter argument; that is, it selects all items that do
not match the filter. For example, the equivalent commands
#+BEGIN_EXAMPLE
> #cleaning (/wash, /wash.blocks).not
#+END_EXAMPLE
shows all items that are tagged with "cleaning", but which do not contain the
word "wash" or are blocking a task containing the word "wash". The same command
can be written using the prefix form of the =not= operator, which is called =!=:
#+BEGIN_EXAMPLE
> #cleaning !(/wash, /wash.b)
#+END_EXAMPLE
**** Dependencies (=depends=)
*Arity:* unary\\
*Alias:* =dep=, =d=\\

The operation /depends/ gives all the items that are (directly) dependent on any
of the items matching a given filter. It is the opposite operation of /blocks/.

For example, the following command adds the tag "maybe" to dependencies of tasks
that are already tagged "maybe":
#+BEGIN_EXAMPLE
> #maybe .dep mod #maybe
#+END_EXAMPLE
**** Blocking (=blocks=)
*Arity:* unary\\
*Alias*: =blo=, =b=\\

The operation /blocks/ gives all the items that are (directly) blocking any of
the items matching a given filter. It is the opposite operation of /depends/.

For example, the following command adds the tag "soon" to the tasks that are
blocking a task that is either tagged with "design" or which begin with the word
"consider":
#+BEGIN_EXAMPLE
> #design, <consider .blo mod #soon
#+END_EXAMPLE
*** Binary operators
Binary operators are written in infix notation.
**** Intersection (space)
*Arity:* binary\\
*Alias:* --- \\

When two filters are written next to each other with spaces between them, this
operator is used to combine the two filters.

The result of =A B= is the set of items that match both filters =A= and =B=. For
example, the following returns all items that are tagged "reading", but which
are not tagged "research":
#+BEGIN_EXAMPLE
> #reading !#research
#+END_EXAMPLE
**** Union (=,=)
*Arity:* binary\\
*Alias:* --- \\

The result of =A, B= is the set of items that match the filter =A= /or/ the
filter =B=. For example, the following command lists all items which depend on
an item that is either active or tagged as "soon":
#+BEGIN_EXAMPLE
> (+active, #soon).depends
#+END_EXAMPLE
