doc/doc.html
<div id="outline-container-org622ef31" class="outline-4">
<h4 id="org622ef31"><span class="section-number-4">2.1.6</span> Completed (<code>done</code>)</h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
<b>Type:</b> boolean<br />
</p>

<p>
This property is on if the item has been marked as completed and off otherwise.
</p>
</div>
</div>
<div id="outline-container-org7ecbae8" class="outline-4">
<h4 id="org7ecbae8"><span class="section-number-4">2.1.7</span> Base urgency (<code>baseurgency</code>)</h4>
<div class="outline-text-4" id="text-2-1-7">
<p>
<b>Type:</b> number<br />
</p>

<p>
The base urgency of an item is the urgency that has been manually assigned to
that item. The <code>urgency</code> property is a read-only property that is computed from
the base urgency after taking into account various other factors.
</p>
</div>
</div>
<div id="outline-container-org11c81b9" class="outline-4">
<h4 id="org11c81b9"><span class="section-number-4">2.1.8</span> Urgency (<code>urgency</code>)</h4>
<div class="outline-text-4" id="text-2-1-8">
<p>
<b>Type:</b> number<br />
</p>

<p>
(Missing documentation.)
</p>
</div>
</div>
</div>
<div id="outline-container-orgf6e67d8" class="outline-3">
<h3 id="orgf6e67d8"><span class="section-number-3">2.2</span> Filter property types</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Each filter property has a type. The types are <i>text</i>, <i>date</i>, <i>number</i>, <i>item</i>
and <i>set</i>. Each type supports various prediates.
</p>
</div>
<div id="outline-container-org73e1235" class="outline-4">
<h4 id="org73e1235"><span class="section-number-4">2.2.1</span> Text</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Note that all of the text predicates are case insensitive by default.
</p>

<p>
<b>Supported prediates:</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operation</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>:</code> (is)</td>
<td class="org-left"><code>prop:{value}</code></td>
<td class="org-left"><code>prop</code> is exactly "<code>value</code>"</td>
</tr>

<tr>
<td class="org-left"><code>/</code> (contains)</td>
<td class="org-left"><code>prop/{substring}</code></td>
<td class="org-left"><code>prop</code> contains "<code>substring</code>"</td>
</tr>

<tr>
<td class="org-left"><code>&lt;</code> (starts with)</td>
<td class="org-left"><code>prop&lt;{prefix}</code></td>
<td class="org-left"><code>prop</code> starts with "<code>prefix</code>"</td>
</tr>

<tr>
<td class="org-left"><code>&gt;</code> (ends with)</td>
<td class="org-left"><code>prop&gt;{suffix}</code></td>
<td class="org-left"><code>prop</code> ends with "<code>suffix</code>"</td>
</tr>

<tr>
<td class="org-left"><code>~</code> (matches)</td>
<td class="org-left"><code>prop~{regex}</code></td>
<td class="org-left"><code>prop</code> matches regular expression "<code>regex</code>"</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd7cfa7a" class="outline-4">
<h4 id="orgd7cfa7a"><span class="section-number-4">2.2.2</span> Boolean</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
<b>Supported prediates:</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operation</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>+</code> (has)</td>
<td class="org-left"><code>+prop</code></td>
<td class="org-left"><code>prop</code> is on</td>
</tr>

<tr>
<td class="org-left"><code>-</code> (hasn't)</td>
<td class="org-left"><code>-prop</code></td>
<td class="org-left"><code>prop</code> is off</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgcaf6e48" class="outline-4">
<h4 id="orgcaf6e48"><span class="section-number-4">2.2.3</span> Date</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
(Missing documentation.)
</p>
</div>
</div>
<div id="outline-container-orgf282b89" class="outline-4">
<h4 id="orgf282b89"><span class="section-number-4">2.2.4</span> Number</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
(Missing documentation.)
</p>
</div>
</div>
<div id="outline-container-org068b0a8" class="outline-4">
<h4 id="org068b0a8"><span class="section-number-4">2.2.5</span> Item</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
(Missing documentation.)
</p>
</div>
</div>
<div id="outline-container-orga414a27" class="outline-4">
<h4 id="orga414a27"><span class="section-number-4">2.2.6</span> Set</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
(Missing documentation.)
</p>
</div>
</div>
</div>
<div id="outline-container-org079087c" class="outline-3">
<h3 id="org079087c"><span class="section-number-3">2.3</span> Filter operators</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Filter operators can be used to modify and compose filters. Operators can be
unary or binary.
</p>
</div>
<div id="outline-container-orgaa2b5f4" class="outline-4">
<h4 id="orgaa2b5f4"><span class="section-number-4">2.3.1</span> Unary operators</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Most unary operators are written as <code>filter .operator</code>. Note
that parentheses can be used to specify how the operator binds to its argument,
and that spacing influences this as well. For example, the following commands
are equivalent:
</p>
<pre class="example">
&gt; ((!#a, !#b).dep).not, #c
&gt; !#a, !#b .dep.not, #c
</pre>
<p>
Some unary operators can be written using prefix syntax. For example, <code>A.not</code>
can also be written <code>!A</code>.
</p>
</div>
<ol class="org-ol">
<li><a id="org46b2613"></a>Invert (<code>not</code>)<br />
<div class="outline-text-5" id="text-2-3-1-1">
<p>
<b>Arity:</b> unary<br />
<b>Alias:</b> <code>!</code> (prefix)<br />
</p>

<p>
This operator inverts the filter argument; that is, it selects all items that do
not match the filter. For example, the equivalent commands
</p>
<pre class="example">
&gt; #cleaning (/wash, /wash.blocks).not
</pre>
<p>
shows all items that are tagged with "cleaning", but which do not contain the
word "wash" or are blocking a task containing the word "wash". The same command
can be written using the prefix form of the <code>not</code> operator, which is called <code>!</code>:
</p>
<pre class="example">
&gt; #cleaning !(/wash, /wash.b)
</pre>
</div>
</li>
<li><a id="orgac025c7"></a>Dependencies (<code>depends</code>)<br />
<div class="outline-text-5" id="text-2-3-1-2">
<p>
<b>Arity:</b> unary<br />
<b>Alias:</b> <code>dep</code>, <code>d</code><br />
</p>

<p>
The operation <i>depends</i> gives all the items that are (directly) dependent on any
of the items matching a given filter. It is the opposite operation of <i>blocks</i>.
</p>

<p>
For example, the following command adds the tag "maybe" to dependencies of tasks
that are already tagged "maybe":
</p>
<pre class="example">
&gt; #maybe .dep mod #maybe
</pre>
</div>
</li>
<li><a id="org67ae6a5"></a>Blocking (<code>blocks</code>)<br />
<div class="outline-text-5" id="text-2-3-1-3">
<p>
<b>Arity:</b> unary<br />
<b>Alias</b>: <code>blo</code>, <code>b</code><br />
</p>

<p>
The operation <i>blocks</i> gives all the items that are (directly) blocking any of
the items matching a given filter. It is the opposite operation of <i>depends</i>.
</p>

<p>
For example, the following command adds the tag "soon" to the tasks that are
blocking a task that is either tagged with "design" or which begin with the word
"consider":
</p>
<pre class="example">
&gt; #design, &lt;consider .blo mod #soon
</pre>
</div>
</li>
</ol>
</div>
<div id="outline-container-org28c6b5e" class="outline-4">
<h4 id="org28c6b5e"><span class="section-number-4">2.3.2</span> Binary operators</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Binary operators are written in infix notation.
</p>
</div>
<ol class="org-ol">
<li><a id="org7910e05"></a>Intersection (space)<br />
<div class="outline-text-5" id="text-2-3-2-1">
<p>
<b>Arity:</b> binary<br />
<b>Alias:</b> &#x2014; <br />
</p>

<p>
When two filters are written next to each other with spaces between them, this
operator is used to combine the two filters.
</p>

<p>
The result of <code>A B</code> is the set of items that match both filters <code>A</code> and <code>B</code>. For
example, the following returns all items that are tagged "reading", but which
are not tagged "research":
</p>
<pre class="example">
&gt; #reading !#research
</pre>
</div>
</li>
<li><a id="orgb340a43"></a>Union (<code>,</code>)<br />
<div class="outline-text-5" id="text-2-3-2-2">
<p>
<b>Arity:</b> binary<br />
<b>Alias:</b> &#x2014; <br />
</p>

<p>
The result of <code>A, B</code> is the set of items that match the filter <code>A</code> <i>or</i> the
filter <code>B</code>. For example, the following command lists all items which depend on
an item that is either active or tagged as "soon":
</p>
<pre class="example">
&gt; (+active, #soon).depends
</pre>
</div>
</li>
</ol>
</div>
</div>
