doc/doc.org
** Local ids and listing references
When listing the items matching a certain filter, the output looks like this:
#+BEGIN_EXAMPLE
> @week #important list
A | Tags                    | Due | Description
--+-------------------------+-----+--------------------------------
1 | #important #research    | mon | Research bobcats
2 | #important #appointment | tue | Meeting with Bob about bobcats
3 | #important              | tue | Send documentation
4 | #important              | fri | Respond to Jane's email
#+END_EXAMPLE
Note the letter "A" in leftmost column of the header. This is called the
*listing reference*. When used in a filter, this reference represents all of the
items in that listing. For example, the command below narrows the above
selection to the tasks that are due later than monday and which don't contain
the word "send":
#+BEGIN_EXAMPLE
> A due>mon !/send
B | Tags                    | Due | Description
--+-------------------------+-----+--------------------------------
1 | #important #appointment | tue | Meeting with Bob about bobcats
2 | #important              | fri | Respond to Jane's email
#+END_EXAMPLE
Note that the listing reference has changed to "B". The listing reference will
cycle through the letters A-Z. Also note the numbers in the leftmost column;
these are the *local ids* of each item. These numbers can be used to refer to an
item inside of a filter. For example, this command shows the second item in the
listing of =@week #important 2= (i.e. "Meeting with Bob about bobcats"), as well
as any items tagged "research":
#+BEGIN_EXAMPLE
> @week #important 2, @none #research
C | Tags                    | Due | Description
--+-------------------------+-----+--------------------------------
1 | #important #research    | mon | Research bobcats
2 | #research               |     | Figure out why penguins can't fly
3 | #important #appointment | tue | Meeting with Bob about bobcats
#+END_EXAMPLE
Most commonly, local ids are used together with listing references to refer to
an item from an earlier listing. Thus, the previous command could also take
advantage of the listing labeled "A", shortening it it to:
#+BEGIN_EXAMPLE
> A 2, #research
#+END_EXAMPLE
As a special abbreviation, the space between the reference and the id may be
omitted. For example:
#+BEGIN_EXAMPLE
> A4, B1
B | Tags                    | Due | Description
--+-------------------------+-----+--------------------------------
1 | #important #appointment | tue | Meeting with Bob about bobcats
2 | #important              | fri | Respond to Jane's email
#+END_EXAMPLE
* Contexts
It is possible to activate any number of different *contexts*. A context
specifies the default filter, as well as a list of properties that will be
automatically added to newly created items. Contexts can either be enabled or
disabled globally, or they can be set for a single command. It is possible to
enable multiple contexts at the same time.

To cretae a new context, use the command =context new [filter] (default
[properties])= (the default part is optional). The following will create a
context called "leisure" in which only items that are tagged with "fun" as well
as items that are active, due and whose urgency exceeds 10 are shown, and where
items are given the property =review:tomorrow= by default:
#+BEGIN_EXAMPLE
> context add leisure #fun, (+active due<=now urgency>=10) default review:tomorrow
#+END_EXAMPLE
To active the context, use =context enable=:
#+BEGIN_EXAMPLE
> context enable leisure
#+END_EXAMPLE
It is possible to override the current contexts for a single command by
prefixing the context name with the =@= character. Contexts stack in the order
they are given, while the special context =@none= disables all contexts. For
instance, the following command enables the contexts "appointments" and
"important" in addition to any contexts that are already enabled:
#+BEGIN_EXAMPLE
> @appointments @important list
#+END_EXAMPLE
This command adds a new item without using any of the default properties from
currently enabled contexts:
#+BEGIN_EXAMPLE
> @none add #shopping {Buy groceries} due:tomorrow@17:00
#+END_EXAMPLE
* Commands
** List selection (=list=)
This is the default command.
** Modify selection (=modify=)
(Missing documentation.)
*** Arguments
(Missing documentation.)
** Add task (=add=)
(Missing documentation.)
** Evaluating expressions (=eval=)
(Missing documentation.)
