doc/doc.html
<div id="outline-container-orgcc49855" class="outline-3">
<h3 id="orgcc49855"><span class="section-number-3">2.4</span> Local ids and listing references</h3>
<div class="outline-text-3" id="text-2-4">
<p>
When listing the items matching a certain filter, the output looks like this:
</p>
<pre class="example">
&gt; @week #important list
A | Tags                    | Due | Description
--+-------------------------+-----+--------------------------------
1 | #important #research    | mon | Research bobcats
2 | #important #appointment | tue | Meeting with Bob about bobcats
3 | #important              | tue | Send documentation
4 | #important              | fri | Respond to Jane's email
</pre>
<p>
Note the letter "A" in leftmost column of the header. This is called the
<b>listing reference</b>. When used in a filter, this reference represents all of the
items in that listing. For example, the command below narrows the above
selection to the tasks that are due later than monday and which don't contain
the word "send":
</p>
<pre class="example">
&gt; A due&gt;mon !/send
B | Tags                    | Due | Description
--+-------------------------+-----+--------------------------------
1 | #important #appointment | tue | Meeting with Bob about bobcats
2 | #important              | fri | Respond to Jane's email
</pre>
<p>
Note that the listing reference has changed to "B". The listing reference will
cycle through the letters A-Z. Also note the numbers in the leftmost column;
these are the <b>local ids</b> of each item. These numbers can be used to refer to an
item inside of a filter. For example, this command shows the second item in the
listing of <code>@week #important 2</code> (i.e. "Meeting with Bob about bobcats"), as well
as any items tagged "research":
</p>
<pre class="example">
&gt; @week #important 2, @none #research
C | Tags                    | Due | Description
--+-------------------------+-----+--------------------------------
1 | #important #research    | mon | Research bobcats
2 | #research               |     | Figure out why penguins can't fly
3 | #important #appointment | tue | Meeting with Bob about bobcats
</pre>
<p>
Most commonly, local ids are used together with listing references to refer to
an item from an earlier listing. Thus, the previous command could also take
advantage of the listing labeled "A", shortening it it to:
</p>
<pre class="example">
&gt; A 2, #research
</pre>
<p>
As a special abbreviation, the space between the reference and the id may be
omitted. For example:
</p>
<pre class="example">
&gt; A4, B1
B | Tags                    | Due | Description
--+-------------------------+-----+--------------------------------
1 | #important #appointment | tue | Meeting with Bob about bobcats
2 | #important              | fri | Respond to Jane's email
</pre>
</div>
</div>
</div>
<div id="outline-container-orgea011e2" class="outline-2">
<h2 id="orgea011e2"><span class="section-number-2">3</span> Contexts</h2>
<div class="outline-text-2" id="text-3">
<p>
It is possible to activate any number of different <b>contexts</b>. A context
specifies the default filter, as well as a list of properties that will be
automatically added to newly created items. Contexts can either be enabled or
disabled globally, or they can be set for a single command. It is possible to
enable multiple contexts at the same time.
</p>

<p>
To cretae a new context, use the command <code>context new [filter] (default
[properties])</code> (the default part is optional). The following will create a
context called "leisure" in which only items that are tagged with "fun" as well
as items that are active, due and whose urgency exceeds 10 are shown, and where
items are given the property <code>review:tomorrow</code> by default:
</p>
<pre class="example">
&gt; context add leisure #fun, (+active due&lt;=now urgency&gt;=10) default review:tomorrow
</pre>
<p>
To active the context, use <code>context enable</code>:
</p>
<pre class="example">
&gt; context enable leisure
</pre>
<p>
It is possible to override the current contexts for a single command by
prefixing the context name with the <code>@</code> character. Contexts stack in the order
they are given, while the special context <code>@none</code> disables all contexts. For
instance, the following command enables the contexts "appointments" and
"important" in addition to any contexts that are already enabled:
</p>
<pre class="example">
&gt; @appointments @important list
</pre>
<p>
This command adds a new item without using any of the default properties from
currently enabled contexts:
</p>
<pre class="example">
&gt; @none add #shopping {Buy groceries} due:tomorrow@17:00
</pre>
</div>
</div>
<div id="outline-container-org6eead94" class="outline-2">
<h2 id="org6eead94"><span class="section-number-2">4</span> Commands</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc75908d" class="outline-3">
<h3 id="orgc75908d"><span class="section-number-3">4.1</span> List selection (<code>list</code>)</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This is the default command.
</p>
</div>
</div>
<div id="outline-container-orgdcbfd54" class="outline-3">
<h3 id="orgdcbfd54"><span class="section-number-3">4.2</span> Modify selection (<code>modify</code>)</h3>
<div class="outline-text-3" id="text-4-2">
<p>
(Missing documentation.)
</p>
</div>
<div id="outline-container-orgfd74ad1" class="outline-4">
<h4 id="orgfd74ad1"><span class="section-number-4">4.2.1</span> Arguments</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
(Missing documentation.)
</p>
</div>
</div>
</div>
<div id="outline-container-org5a979c1" class="outline-3">
<h3 id="org5a979c1"><span class="section-number-3">4.3</span> Add task (<code>add</code>)</h3>
<div class="outline-text-3" id="text-4-3">
<p>
(Missing documentation.)
</p>
</div>
</div>
<div id="outline-container-orgdddc6f7" class="outline-3">
<h3 id="orgdddc6f7"><span class="section-number-3">4.4</span> Evaluating expressions (<code>eval</code>)</h3>
<div class="outline-text-3" id="text-4-4">
<p>
(Missing documentation.)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-04-28 Sun 22:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
